app/controllers/auth_controller.rb

SELECT  "members".* FROM "members" WHERE "members"."username" = ? LIMIT ?  [["username", "kyle"], ["LIMIT", 1]]
---
  def login
    # byebug
    username = params[:username]
    pw = params[:password]
    member = Member.find_by(username: username)