app/controllers/beers_controller.rb

SELECT  "beers".* FROM "beers" ORDER BY "beers"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    def index
      @beers = Beer.all